Public Attributes | List of all members
API_CWContourData Struct Reference
Curtain Wall
Represents a curtain wall contour type element. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Polygon  | polygon
The curtain wall contour polygon.
API_Coord **  | coords
The coordinates of the curtain wall contour polygon.
Int32 **  | pends
Polygon end vertex indices.
API_PolyArc **  | parcs
Arc indices in the polygon.
UInt32 **  | vertexIDs
Vertex indices.
Detailed Description
Represents a curtain wall contour type element.
Remarks
.
Member Data Documentation
◆ coords
 API_CWContourData::coords
The coordinates of the curtain wall contour polygon.
◆ parcs
 API_CWContourData::parcs
Arc indices in the polygon.
◆ pends
 API_CWContourData::pends
Polygon end vertex indices.
◆ polygon
 API_CWContourData::polygon
The curtain wall contour polygon.
◆ vertexIDs
 API_CWContourData::vertexIDs
Vertex indices.